# დავალება 1.
#
# სოკეტების გამოყენებით დაწერეთ კლიენტისა და სერვერის მხარე, სოკეტები უნდა მოქმედებდეს
# TCP პროტოკოლის გამოყენებით. სერვერის სოკეტს უნდა შეეძლოს რექვესტების მიღება ნებისმიერი
# ჰოსტიდან. მაგალითისათვის კი სერვერის კავშირის შექმნის დროს დაბეჭდეთ დაკავშირებული ჰოსტის
# მისამართი და კლიენტის მხარეს გამოაგზავნეთ შეტყობინება რომ კავშირი შედგა წარმატებით,
# დაბეჭდეთ კლიენტის მხარეს.
#
# დავალება 2.
#
# სოკეტების გამოყენებით დაწერეთ ჩატი, სოკეტები უნდა მოქმედებდეს TCP პროტოკოლით, სერვერის
# სოკეტს უნდა შეეძლოს რექვესტების მიღება მხოლოდ ლოკალური ჰოსტიდან, მიმოწერა შეინახეთ ტექსტურ ფაილში.
#
# დავალება 3.
#
# მოიძიეთ ინფორმაცია UDP პროტოკოლის შესახებ და სცადეთ ჩატის აწყობა მოცემული პროტოკოლის გამოყენებით

