# import psycopg2
#
# host = 'localhost' #127.0.0.1
# port = 5432
# database = 'deposits'
# user = 'postgres'
# password = '9919'
#
# connection = psycopg2.connect(host=host, port=port, database=database, user=user, password=password)
# print(connection)
#
# cursor = connection.cursor()
#
#
#
# განსაზღვრეთ Book კლასი:
#
# კლასს უნდა ჰქონდეს შემდეგი ატრიბუტები:
#
# title: წიგნის სათაური.
#
# author: წიგნის ავტორი.
#
# release_year: წიგნის გამოშვების წელი.
#
# isbn: წიგნის საერთაშორისო სტანდარტული ნომერი (ISBN), წიგნის უნიკალური იდენტიფიკატორი.
#
# მონაცემთა ბაზის კავშირი:
#
# დაამყარეთ კავშირი მონაცემთა ბაზასთან.
#
# მონაცემთა ბაზაში უნდა შეიქმნას წიგნების შესანახი ცხრილი
#
# ფუნქციონალობა:
#
# აღწერეთ ფუნქციები შემდეგი მოქმედებების გასახორციელებლად
#
# ახალი წიგნის დამატება: დაამატეთ ახალი წიგნი მონაცემთა ბაზაში
#
# ყველა წიგნის წაკითხვა: წაიკითხეთ ყველა წიგნის ჩანაწერი ბაზიდან
#
# წიგნის ძიება: წიგნის მოძიება ISBN მნიშვნელობის მიხედვით
#
# წიგნის დეტალების განახლება: ნებისმიერი წიგნის ატრიბუტების ცვლილება ბაზაში
#
# წაშალეთ წიგნი: წიგნის ამოშლა მონაცემთა ბაზაში
#
# მომხმარებლის ქმედება:
#
# შექმენით მენიუზე ორიენტირებული ინტერფეისი, რომელიც მომხმარებლებს საშუალებას აძლევს აირჩიოს ქმედება
#
# ახალი წიგნის დამატება
#
# ყველა წიგნის წაკითხვა
#
# წიგნის ძიება
#
# წიგნის დეტალების განახლება
#
# წაშალეთ წიგნი
#
# პროგრამიდან გასვლა
#
# მომხმარებლის ინფუთის შესაბამისად აამოქმედეთ ფუნქცია.
#
# თითოეული მოქმედება მაქსიმალურად გადაანაწილეთ ფუნქციებში