

# დავალება 1.

# დაწერეთ ფუნქცია, რომელიც უბრალოდ აბრუნებს არგუმენტად გადაწოდებულ რიცხვს,
#  დაუწერეთ დეკორატორი, რომელიც შეამოწმებს, რომ რიცხვი უნდა იყოს დადებითი,
#  თუ არის უარყოფითი ამ შემთხვევაში დააბრუნეთ ValueError შესაბამისი ტექსტით, 
# სხვა შემთხვევაში აამოქმედეთ ფუნქცია, შედეგი კი დაბეჭდეთ დეკორატორიდან.





# დავალება 2.

# დაწერეთ პირველი დავალება ფუნქტორის გამოყენებით



# დავალება 3.

# დაწერეთ დეკორატორი, რომელიც გამოთვლის ფუნქციის მოქმედების დროს და დაბეჭდავს
#  ტერმინალში. დროის აღსაქმელად გამოიყენეთ time.time()



# დავალება 4.

# შექმენით მეტაკლასი LoggingMeta, რომელიც ყოველი კლასის შექმნის დროს 
# დაბეჭდავს თუ რა სახელის მქონე კლასი იქმნება.

