
# აღწერეთ ორი კლასი შემდეგი მონაცემების მიხედვით:

# Person:
# name
# deposit (default value = 1000, მიუთითებს ამჟამად რამდენი აქვს დეპოზიტზე)
# loan (default value = 0, მიუთითებს ამჟამად რამდენი აქვს სესხი აღებული)


# House:
# ID – ბინის საკატასტრო კოდი
# price – ბინის ფასი
# owner – სახლის მეპატრონე (Person ტიპის ობიექტი)
# status – ახალი ბინის დამატებისას სტატუსი არის ყოველთვის “გასაყიდი”


# გაითვალისწინეთ owner-ის მნიშვნელობა არის Person კლასის ობიექტი

# Person კლასში დაამატეთ __str__ მეთოდი რომელიც დააბრუნებს პიროვნების სრულ ინფორმაციას


# შექმენით ორი Person კლასის ობიექტი(მაგალითად ერთი მეპატრონე, მეორე მყიდველი). ასევე
# შექმენით House კლასის ობიექტი რომლის owner იქნება ერთ-ერთი Person ობიექტი

# House კლასში დაამატეთ ბინის გაყიდვის მეთოდი, რომლის დროსაც პარამეტრებად გადაეცემა
# მყიდველი, თუ მეტი პარამეტრი არ გადაეცემა, ამ დროს უნდა შესრულდეს ბინის გაყიდვის
# ოპერაცია(გამყიდველის deposit უნდა გაიზარდოს ბინის ღირებულებით, უნდა შეიცვალოს
# owner და status უნდა გახდეს “გაყიდული”, დაბეჭდეთ შესაბამისი ტექსტი). თუ ამ მეთოდის
# გამოძახების დროს მყიდველის გარდა პარამეტრად გადაეცა კიდევ ერთი რიცხვი, მაშინ შესრულდეს
#  ბინის სესხით გაყიდვის ოპერაცია, სადაც პარამეტრად გადაცემული რიცხვი მიუთითებს მყიდველის
# მიერ აღებული სესხის რაოდენობას, მეთოდმა კი უნდა შეასრულოს შემდეგი ოპერაციები: გამყიდველის
# deposit უნდა გაიზარდოს ბინის ღირებულებით, owner უნდა შეიცვალოს, status გახდეს “გაყიდული სესხით”,
#  მყიდველის სესხი (loan) უნდა გაიზარდოს შესაბამისი რაოდენობით და დაიბეჭდოს გაყიდვის შესაბამისი შეტყობინება.

# კლასის გარეთ მოახდინეთ აღწერილი ფუნქციების გამოძახება
