# დავალება 1.

# შეიმუშავეთ საბანკო ანგარიშის ძირითადი სისტემა. შექმენით კლასი
# სახელწოდებით BankAccount, ისეთი ატრიბუტებით, როგორიცაა account_number,
# account_holder და balance. აღწერეთ ფულის ჩარიცხვის და გამოტანის მეთოდები.
#  შექმენით რამდენიმე ობიექტი და განახორციელეთ რამდენიმე ტრანზაქცია.

efef
eliffeffe


# დავალება 2.

# შექმენით კლასი სახელწოდებით Student ატრიბუტებით, როგორიცაა name,
# student_id და courses(კურსების სია, რომელშიც სტუდენტი არის ჩარიცხული).
# აღწერეთ სტუდენტის ინფორმაციის და კურსების ჩვენების მეთოდები. შექმენით
# რამდენიმე ობიექტი და დაარეგისტრირეთ სხვადასხვა კურსებზე.
