# დაწერეთ პროგრამა ონლაინ ბილეთების გაყიდვის ვებ გვერდისთვის.
# შექმენით მომხმარებლების სია (10-15 პერსონა) უნდა მოახდინოთ
# რიგის მენეჯმენტი ვებსაიტზე, ერთდროულად 5 ადამიანს უნდა შეეძლოს
# ყიდვის სესიაში შესვლა(Semaphore) დაბეჭდეთ რომ მომხმარებელი ცდილობს
# სესიაში შესვლას და თუ შევიდა სესიაში დაბეჭდეთ რომ დაიკავა ადგილი
# კონკრეტულმა მომხმარებელმა. მომხმარებელი რომელიც შესულია სესიაში
# ბილეთს იყიდის 5 წამში (sleep) და გაათავისუფლებს ადგილს შემდეგი
# მომხმარებლისთვის. პროგრამა დაასრულებს მუშაობას როდესაც ყველა
# მომხმარებელი იყიდის ბილეთს.
# პ.ს. გამოიყენეთ parking-ის ნაწილი რომელიც ლექციაზე გავაკეთეთ
